import json
import requests
from fastapi import FastAPI
from fastapi.responses import JSONResponse
from pydantic import BaseModel
from typing import List
from dotenv import load_dotenv
import os
import uvicorn

# โหลดไฟล์ .env
load_dotenv()

API_KEY = os.getenv("API_KEY_MODEL")

app = FastAPI()

# Request schema
class ChunkItem(BaseModel):
    chunk_id: str = "18a047f8-072f-4e1e-802d-00ed07ec8b63"
    chunk: str = "ระเบียบสภากาชาดไทย\n\nว่าด้วย การบริหารงานทรัพยากรบุคคลสำหรับเจ้าหน้าที่วิสามัญ พ.ศ. 2567\n\n----------------------------------------------\n\nเพื่อให้เป็นไปตามข้อ ๑๕ (๑) (ก) แห่งระเบียบสภากาชาดไทย ว่าด้วย การบริหารงานทรัพยากรบุคคล พ.ศ. 2567 คณะกรรมการบริหารสภากาชาดไทย ในการประชุมครั้งที่ 12/2566 เมื่อวันที่ 14 ธันวาคม พ.ศ. 2566 จึงมีมติให้วางระเบียบไว้ดังต่อไปนี้\nข้อ 1 ระเบียบนี้เรียกว่า “ระเบียบสภากาชาดไทย ว่าด้วย การบริหารงานทรัพยากรบุคคลสำหรับเจ้าหน้าที่วิสามัญ พ.ศ. 2567”\nข้อ 2 ระเบียนนี้ให้ใช้บังคับกับเจ้าหน้าที่วิสามัญกลุ่มที่ 1 ตามข้อ 15 (1) (ก) แห่งระเบียบสภากาชาดไทยว่าด้วย การบริหารงานทรัพยากรบุคคล พ.ศ. 2567\nข้อ 3 ระเบียนนี้ให้ใช้บังคับตั้งแต่วันที่ 1 มกราคม พ.ศ. 2567 เป็นต้นไป\nข้อ 4 บรรดาระเบียบ หรือประกาศอื่นในส่วนที่มีบัญญัติไว้แล้วในระเบียบนี้ หรือที่ขัดหรือแย้งต่อระเบียนนี้ ให้ใช้ระเบียนนี้แทน"
    kb_id: str = "บค_2"

class CitationRequest(BaseModel):
    answer: str = "ตามที่ระบุในระเบียบสภากาชาดไทย ว่าด้วย การบริหารงานทรัพยากรบุคคลสำหรับเจ้าหน้าที่วิสามัญ พ.ศ. 2567 ข้อ 3 ระเบียบนี้ให้ใช้บังคับตั้งแต่วันที่ 1 มกราคม พ.ศ. 2567 เป็นต้นไปดังนั้น คณะกรรมการบริหารสภากาชาดไทย การประชุมที่ 12/2566 มีมติให้บังคับใช้ระเบียบนี้ตั้งแต่วันที่ 1 มกราคม พ.ศ. 2567 เป็นต้นไป"
    chunks: List[ChunkItem]
    message: str = "Success"

def citation(ai_answer: str, chunks):
    url = "https://ai-api.manageai.co.th/llm-model-02/v1/chat/completions"

    prompt = f"""คุณคือผู้เชี่ยวชาญในการทำ Citation โดยมีหน้าที่ค้นหาที่มาของ AI answer นี้ : "{ai_answer}", จาก chunk ทั้งหมดนี้ : "{chunks}"

            ### งานที่ต้องทำ ###
            1. ตรวจสอบว่า AI answer นี้ : "{ai_answer}" ปรากฏอยู่ส่วนไหนใน chunks ที่กำหนดให้ ซึ่งแต่ละ chunk เก็บอยู่ในรูปแบบ list
            2. หากพบ ให้ทำการ highlight ข้อมูลที่เป็น AI answer ด้วย html tag เช่น :
                <h>...</h> สำหรับหัวข้อ
                <mark>...</mark> สำหรับข้อความที่ highlight
            3. แสดงผลลัพธ์เฉพาะ chunk ทั้งหมดที่เจอข้อมูล และต้องมีการ highlight ข้อความที่ตรงกับคำตอบด้วย
            4. ห้ามแสดงข้อความอื่นที่นอกเหนือข้อมูลใน chunk
            5. ถ้าไม่พบข้อความที่ต้อง highlight ให้แสดงข้อความว่า "ไม่พบข้อมูลที่ตรงกับคำตอบ"
            
            ### Output ###
            1. **แสดงผลลัพธ์ข้อความทั้งหมดใน chunk ที่เจอข้อมูล และต้องมีการ highlight ส่วนของข้อความที่ตรงหรือเกี่ยวข้องกับคำตอบด้วย**
            2. **ห้ามแสดงข้อความอื่นที่นอกเหนือข้อมูลใน chunk และ tag เช่น "ข้อมูลที่พบ","สรุปผลลัพธ์"*
            
            ### ตัวอย่าง Output: ###
            ตัวอย่าง output กรณีที่มีข้อความ mark
                AI answer : "เจ้าหน้าที่วิสามัญ คือ ผู้ช่วยเหรัญญิก ของสภากาชาดไทย"
                Chunk : ["ข้อ 5 ในระเบียนนี้ “เจ้าหน้าที่วิสามัญ” หมายความว่า ผู้ดำรงตำแหน่งเลขานุการ เหรัญญิก ผู้ช่วยเลขานุการ และผู้ช่วยเหรัญญิก ของสภากาชาดไทย “สวัสดิการเกี่ยวกับการรักษาพยาบาล” หมายความว่า ค่ารักษาพยาบาลที่เกิดขึ้นจากการเข้ารับการรักษาพยาบาลในสถานพยาบาลของสภากาชาดไทย “เงินสวัสดิการเกี่ยวกับการรักษาพยาบาล” หมายความว่า ค่ารักษาพยาบาลที่เกิดขึ้นจากการเข้ารับการรักษาพยาบาลในสถานพยาบาลของทางราชการ และหรือสถานพยาบาลของเอกชน ที่มีลักษณะการให้บริการเป็นโรงพยาบาล “การรักษาพยาบาล” หมายความว่า การให้บริการด้านการแพทย์และสาธารณสุขโดยตรงแก่ผู้มีสิทธิหรือบุคคลในครอบครัว หรือผู้มีสิทธิเฉพาะตัว เพื่อการรักษาโรค การตรวจวินิจฉัย การฟื้นฟูสมรรถภาพที่จำเป็นต่อสุขภาพและการดำรงชีวิต และให้หมายความรวมถึงการตรวจสุขภาพประจำปีที่สถานพยาบาลของสภากาชาดไทย การป้องกันโรคเพื่อประโยชน์ด้านสาธารณสุข แต่ไม่รวมถึงการเสริมความงาม ทั้งนี้ ให้เป็นไปตามที่สภากาชาดไทยกำหนด ข้อ 6 ให้อุปนายกผู้อำนวยการสภากาชาดไทย เป็นผู้รักษาการตามระเบียนนี้"]
                Output : "ข้อ 5 ในระเบียนนี้ <mark>“เจ้าหน้าที่วิสามัญ” หมายความว่า ผู้ดำรงตำแหน่งเลขานุการ เหรัญญิก ผู้ช่วยเลขานุการ และผู้ช่วยเหรัญญิก ของสภากาชาดไทย</mark> “สวัสดิการเกี่ยวกับการรักษาพยาบาล” หมายความว่า ค่ารักษาพยาบาลที่เกิดขึ้นจากการเข้ารับการรักษาพยาบาลในสถานพยาบาลของสภากาชาดไทย “เงินสวัสดิการเกี่ยวกับการรักษาพยาบาล” หมายความว่า ค่ารักษาพยาบาลที่เกิดขึ้นจากการเข้ารับการรักษาพยาบาลในสถานพยาบาลของทางราชการ และหรือสถานพยาบาลของเอกชน ที่มีลักษณะการให้บริการเป็นโรงพยาบาล “การรักษาพยาบาล” หมายความว่า การให้บริการด้านการแพทย์และสาธารณสุขโดยตรงแก่ผู้มีสิทธิหรือบุคคลในครอบครัว หรือผู้มีสิทธิเฉพาะตัว เพื่อการรักษาโรค การตรวจวินิจฉัย การฟื้นฟูสมรรถภาพที่จำเป็นต่อสุขภาพและการดำรงชีวิต และให้หมายความรวมถึงการตรวจสุขภาพประจำปีที่สถานพยาบาลของสภากาชาดไทย การป้องกันโรคเพื่อประโยชน์ด้านสาธารณสุข แต่ไม่รวมถึงการเสริมความงาม ทั้งนี้ ให้เป็นไปตามที่สภากาชาดไทยกำหนด ข้อ 6 ให้อุปนายกผู้อำนวยการสภากาชาดไทย เป็นผู้รักษาการตามระเบียนนี้"
            
            ตัวอย่าง output กรณีที่ไม่พบข้อความที่ต้อง highlight
                AI answer : "เกี่ยวกับการกิน"
                Chunk : ["ข้อ 5 ในระเบียนนี้ “เจ้าหน้าที่วิสามัญ” หมายความว่า ผู้ดำรงตำแหน่งเลขานุการ เหรัญญิก ผู้ช่วยเลขานุการ และผู้ช่วยเหรัญญิก ของสภากาชาดไทย “สวัสดิการเกี่ยวกับการรักษาพยาบาล” หมายความว่า ค่ารักษาพยาบาลที่เกิดขึ้นจากการเข้ารับการรักษาพยาบาลในสถานพยาบาลของสภากาชาดไทย “เงินสวัสดิการเกี่ยวกับการรักษาพยาบาล” หมายความว่า ค่ารักษาพยาบาลที่เกิดขึ้นจากการเข้ารับการรักษาพยาบาลในสถานพยาบาลของทางราชการ และหรือสถานพยาบาลของเอกชน ที่มีลักษณะการให้บริการเป็นโรงพยาบาล “การรักษาพยาบาล” หมายความว่า การให้บริการด้านการแพทย์และสาธารณสุขโดยตรงแก่ผู้มีสิทธิหรือบุคคลในครอบครัว หรือผู้มีสิทธิเฉพาะตัว เพื่อการรักษาโรค การตรวจวินิจฉัย การฟื้นฟูสมรรถภาพที่จำเป็นต่อสุขภาพและการดำรงชีวิต และให้หมายความรวมถึงการตรวจสุขภาพประจำปีที่สถานพยาบาลของสภากาชาดไทย การป้องกันโรคเพื่อประโยชน์ด้านสาธารณสุข แต่ไม่รวมถึงการเสริมความงาม ทั้งนี้ ให้เป็นไปตามที่สภากาชาดไทยกำหนด ข้อ 6 ให้อุปนายกผู้อำนวยการสภากาชาดไทย เป็นผู้รักษาการตามระเบียนนี้"]
                Output : "ไม่พบข้อมูลที่ตรงกับคำตอบ"
        """

    payload = json.dumps({
        "model": "Qwen/Qwen2-VL-72B-Instruct-AWQ",
        "messages": [
            {"role": "system", "content": [{"type": "text", "text": prompt}]},
            {
                "role": "user",
                "content": [
                    {"type": "text", "text": "This is input AI answer : " + ai_answer},
                    {"type": "text", "text": "The answer expected from AI: "}
                ]
            }
        ],
        "temperature": 0.001,
        "max_tokens": 4096,
        "frequency_penalty": 1.2,
        "repetition_penalty": 1.2,
    })

    headers = {
        'Content-Type': 'application/json',
        'Authorization': f'Basic {API_KEY}',
        'Cookie': 'Path=/'
    }

    response = requests.post(url, headers=headers, data=payload)
    try:
        return response.json(), response.status_code
    except Exception as e:
        print("API response is not JSON!")
        print("Status code:", response.status_code)
        print("Response text:", response.text)
        raise e

@app.post("/api/v1/citation")
async def main(request: CitationRequest):
    ai_answer = request.answer
    chunks = request.chunks
    chunks_list = [item.chunk for item in chunks]

    result, code = citation(ai_answer, chunks_list)
    extracted_json_data = result.get("choices", [{}])[0].get("message", {}).get("content", "No content returned")

    status = (code == 200)
    message = "Processed successfully" if status else f"Processed successfully"
    
    # แปลง ChunkItem objects เป็น dict ก่อนส่ง JSON
    chunks_serializable = [item.model_dump() for item in chunks]

    return JSONResponse(
        status_code=200,
        content={
            "code": code,
            "message": message,
            "status": status,
            "data": {
                "chunks": chunks_serializable,
                "citation": extracted_json_data
            }
        }
    )
    
if __name__ == "__main__":
    uvicorn.run(
        "citation:app",
        host=os.getenv("APP_HOST", "0.0.0.0"),
        port=int(os.getenv("APP_PORT", 8000)),
        reload=os.getenv("DEBUG", "False") == "True"
    )
    
    '''
    curl -X POST "http://localhost:8000/api/v1/citation" \
    -H "Content-Type: application/json" \
    -d '{
            "answer": "ตามที่ระบุในระเบียบสภากาชาดไทย ว่าด้วย การบริหารงานทรัพยากรบุคคลสำหรับเจ้าหน้าที่วิสามัญ พ.ศ. 2567 ข้อ 3 ระเบียบนี้ให้ใช้บังคับตั้งแต่วันที่ 1 มกราคม พ.ศ. 2567 เป็นต้นไป ดังนั้น คณะกรรมการบริหารสภากาชาดไทย การประชุมที่ 12/2566 มีมติให้บังคับใช้ระเบียบนี้ตั้งแต่วันที่ 1 มกราคม พ.ศ. 2567 เป็นต้นไป",
            "chunks": [
                {
                    "chunk_id": "dd01f969-0775-46bb-ad38-53defe281543",
                    "chunk": "ข้อ 7 ให้ผู้ดำรงตำแหน่งเจ้าหน้าที่วิสามัญได้รับค่าตอบแทน สวัสดิการ และสิทธิประโยชน์ด้านการรักษาพยาบาล ดังนี้ (1) ค่าตอบแทนประจำตำแหน่ง ค่าตอบแทนพิเศษรายเดือน และเงินประจำตำแหน่งตามประกาศสภากาชาดไทยว่าด้วยเรื่องนั้น (2) สวัสดิการเกี่ยวกับการรักษาพยาบาล (3) สิทธิประโยชน์ด้านการรักษาพยาบาลเฉพาะตัว กรนี้เข้ารับการรักษาพยาบาลในสถานพยาบาลของสภากาชาดไทย ตามระเบียบสภากาชาดไทย ว่าด้วย สิทธิประโยชน์ด้านการรักษาพยาบาลของผู้มีอุปการคุณสภากาชาดไทย พ.ศ. ๒๕๖๐ (4) เงินสวัสดิการเกี่ยวกับการรักษาพยาบาล หากเจ้าหน้าที่วิสามัญพ้นจากตำแหน่งที่มีใช้กรณีตามข้อ ๑๐ (๑) และ (๓) ให้คงใช้สิทธิในข้อ ๗ (๒) (๓) และ (๔) ได้ต่อไปจนกว่าจะเสียชีวิต ข้อ 8 บุคคลในครอบครัวของเจ้าหน้าที่วิสามัญ ให้รับสิทธิสวัสดิการเกี่ยวกับการรักษาพยาบาลและหรือเงินสวัสดิการเกี่ยวกับการรักษาพยาบาลตลอดระยะเวลาที่เจ้าหน้าที่วิสามัญยังคงครองตำแหน่งบุคคลในครอบครัว ได้แก่ ก. บุตรที่ชอบด้วยกฎหมายซึ่งยังไม่บรรลุนิติภาวะ หรือบรรลุนิติภาวะ แล้วแต่เป็นคนไร้ความสามารถหรือเสมือนไร้ความสามารถซึ่งอยู่ในความอุปการะเลี้ยงดูของเจ้าหน้าที่วิสามัญ แต่ทั้งนี้ไม่รวมถึงบุตรบุญธรรม หรือบุตรซึ่งให้ไปเป็นบุตรบุญธรรมของบุคคลอื่น ข. คู่สมรสที่ชอบด้วยกฎหมาย ค. บิดาหรือมารดาที่ชอบด้วยกฎหมาย ข้อ 9 ให้นำประมวลสภากาชาดไทย เรื่อง หลักเกณฑ์และวิธีการใช้สิทธิการรักษาพยาบาล มาใช้บังคับกับการใช้สิทธิสวัสดิการเกี่ยวกับการรักษาพยาบาล รวมถึงเงินสวัสดิการเกี่ยวกับการรักษาพยาบาลของเจ้าหน้าที่วิสามัญ และบุคคลในครอบครัว โดยอนุโลม ข้อ 10 เจ้าหน้าที่วิสามัญ พ้นจากตำแหน่งในกรณีใดกรณีหนึ่งดังต่อไปนี้ (1) ตาย (2) ลาออก (3) ถูกจำกัดโดยคำพิพากษาถึงที่สุดให้จำคุก (4) เป็นบุคคลล้มละลาย (5) เป็นคนไร้ความสามารถหรือคนเสมือนไร้ความสามารถ (6) เป็นผู้ดำรงตำแหน่งทางการเมือง สมาชิกสภาท้องถิ่นหรือ ผู้บริหารท้องถิ่น กรรมการหรือผู้ดำรงตำแหน่งที่รับผิดชอบในการบริหารพรรคการเมือง ที่ปรึกษาพรรคการเมือง หรือเจ้าหน้าที่พรรคการเมือง ข้อ 11 ผู้ช่วยเลขานิการหรือผู้ช่วยเหรัญญิก ย่อมพ้นหน้าที่ไปพร้อมกับเลขานิการหรือเหรัญญิก ประกาศ ณ วันที่ ๒๘ ธันวาคม พ.ศ. ๒๕๖๖ (นายเตช บุนนาค) เลขานิการฯ ปฏิบัติการแทน อุปนายิกาผู้อำนวยการสภากาชาดไทย",
                    "kb_id": "บค_2",
                },
                {
                    "chunk_id": "ed207a40-1b2b-4e5d-afcc-594a2f22c0d7",
                    "chunk": "ข้อ 5 ในระเบียนนี้ “เจ้าหน้าที่วิสามัญ” หมายความว่า ผู้ดำรงตำแหน่งเลขานุการ เหรัญญิก ผู้ช่วยเลขานุการ และผู้ช่วยเหรัญญิก ของสภากาชาดไทย “สวัสดิการเกี่ยวกับการรักษาพยาบาล” หมายความว่า ค่ารักษาพยาบาลที่เกิดขึ้นจากการเข้ารับการรักษาพยาบาลในสถานพยาบาลของสภากาชาดไทย “เงินสวัสดิการเกี่ยวกับการรักษาพยาบาล” หมายความว่า ค่ารักษาพยาบาลที่เกิดขึ้นจากการเข้ารับการรักษาพยาบาลในสถานพยาบาลของทางราชการ และหรือสถานพยาบาลของเอกชน ที่มีลักษณะการให้บริการเป็นโรงพยาบาล “การรักษาพยาบาล” หมายความว่า การให้บริการด้านการแพทย์และสาธารณสุขโดยตรงแก่ผู้มีสิทธิหรือบุคคลในครอบครัว หรือผู้มีสิทธิเฉพาะตัว เพื่อการรักษาโรค การตรวจวินิจฉัย การฟื้นฟูสมรรถภาพที่จำเป็นต่อสุขภาพและการดำรงชีวิต และให้หมายความรวมถึงการตรวจสุขภาพประจำปีที่สถานพยาบาลของสภากาชาดไทย การป้องกันโรคเพื่อประโยชน์ด้านสาธารณสุข แต่ไม่รวมถึงการเสริมความงาม ทั้งนี้ ให้เป็นไปตามที่สภากาชาดไทยกำหนด ข้อ 6 ให้อุปนายกผู้อำนวยการสภากาชาดไทย เป็นผู้รักษาการตามระเบียนนี้",
                    "kb_id": "บค_2"
                }
            ],
            "message": "Process successfully"
        }'
    '''